tap "nikitabobko/tap"
brew "bash"
brew "bat"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gh"
brew "python@3.13"
brew "git-filter-repo"
brew "go"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "luarocks"
brew "neofetch"
brew "neovim"
brew "node"
brew "pipx"
brew "poppler"
brew "powerlevel10k"
brew "pyenv"
brew "tcl-tk"
brew "python-tk@3.13"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "aerospace"
cask "alacritty"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "kitty"
cask "rar"
cask "raycast"
cask "stats"
vscode "adrianwilczynski.asp-net-core-switcher"
vscode "alexcvzz.vscode-sqlite"
vscode "batisteo.vscode-django"
vscode "be5invis.vscode-custom-css"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-myssql-client2"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "emroussel.atomize-atom-one-dark-theme"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "glenn2223.live-sass"
vscode "hediet.debug-visualizer"
vscode "helixquar.randomeverything"
vscode "humao.rest-client"
vscode "jetbrains.resharper-code"
vscode "junstyle.vscode-django-support"
vscode "kamikillerto.vscode-colorize"
vscode "kevin-chatham.aspnetcorerazor-html-css-class-completion"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kreativ-software.csharpextensions"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.blazorwasm-companion"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-repositories"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "ritwickdey.liveserver"
vscode "salesforce.codey-midnight"
vscode "siris01.ayu-green"
vscode "sourcery.sourcery"
vscode "stivo.tailwind-fold"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wallabyjs.console-ninja"
vscode "wholroyd.jinja"
vscode "zhuangtongfa.material-theme"
